merlorfer/esp32zigbee_coordinator/sdkconfig.defaults
# ESP32-C6 Zigbee Gateway - SDK Configuration Defaults

# Target
CONFIG_IDF_TARGET="esp32c6"

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash Size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Zigbee Configuration
CONFIG_ZB_ENABLED=y
CONFIG_ZB_COORDINATOR_ROLE=y
CONFIG_ZB_ZCL_SUPPORT_CLUSTER_ON_OFF=y
CONFIG_ZB_ZCL_SUPPORT_CLUSTER_BASIC=y

# IEEE 802.15.4
CONFIG_IEEE802154_ENABLED=y

# Wi-Fi Configuration
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# SPIFFS Configuration
CONFIG_SPIFFS_MAX_PARTITIONS=1

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072

# Log Level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Stack Sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072

# LWIP
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_RCVBUF=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Newlib - nano formatting
CONFIG_NEWLIB_NANO_FORMAT=y
